[{"book_title": "PowerShell Troubleshooting Guide", "book_author": "Michael Shepard", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/03/PowerShell-Troubleshooting-Guide-400x493.jpg", "book_content": "Windows PowerShell provides an amazing platform for administrative scripting and automation. Understanding the PowerShell language will enable you to spend less time troubleshooting and be more effective when debugging is required. PowerShell also includes several avenues to provide feedback from your code that will make your troubleshooting and…"}, {"book_title": "VMware vSphere 5.5 Essentials", "book_author": "Christian Stankowic", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/03/VMware-vSphere-5.5-Essentials-400x493.jpg", "book_content": "Efficiently virtualize your IT infrastructure with vSphere About This Book Plan, deploy, and manage your vSphere environment for even the most complex IT infrastructures Familiarize yourself with vSphere infrastructure to become a skilled vSphere administrator Seamlessly configure and deploy vSphere with simple examples in this fast-paced guide Who…"}, {"book_title": "Études for ClojureScript", "book_author": "J. David Eisenberg", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/03/efc-391x500.png", "book_content": "A short composition that provides practice material for a particular musical skill is called an йtude. In this hands-on book, you’ll find more than 30 йtudes to help you practice ClojureScript skills for specific programming areas, ranging from functions and variables to asynchronous processing. Each of these small…"}, {"book_title": "Mastering NetScaler VPX", "book_author": "Marius Sandbu", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/03/Mastering-Netscaler-VPX-400x493.jpg", "book_content": "Citrix NetScaler is one of the best Application Delivery Controller products in the world. The Application Delivery Controllers are commonly used for load balancing purposes, to optimize traffic, and to perform extra security settings. This book will give you an insight into all the available features that the…"}, {"book_title": "How Software Works", "book_author": "V. Anton Spraul", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/03/How-Software-Works.jpg", "book_content": "We use software every day to perform all kinds of magical, powerful tasks. It’s the force behind stunning CGI graphics, safe online shopping, and speedy Google searches. Software drives the modern world, but its inner workings remain a mystery to many. How Software Works explains how computers perform common-yet-amazing…"}, {"book_title": "Service Oriented Architecture For Dummies", "book_author": "by Judith Hurwitz", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/03/Service-Oriented-Architecture-For-Dummies.jpg", "book_content": "SOA is the most important initiative facing IT today and is difficult to grasp; this book demystifies the complex topic of SOA and makes it accessible to all those people who hear the term but aren’t really sure what it means This team of well-respected authors explains that…"}, {"book_title": "The Linux Command Line, 2nd Edition", "book_author": "William E. Shotts Jr.", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/03/The-Linux-Command-Line-2nd-Edition.jpg", "book_content": "You’ve experienced the shiny, point-and-click surface of your Linux computer–now dive below and explore its depths with the power of the command line. The Linux Command Line takes you from your very first terminal keystrokes to writing full programs in Bash, the most popular Linux shell (or command line)…."}, {"book_title": "Head First Kotlin", "book_author": "David Griffiths", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/03/Head-First-Kotlin-400x463.jpg", "book_content": "What will you learn from this book? Head First Kotlin is a complete introduction to coding in Kotlin. This hands-on book helps you learn the Kotlin language with a unique method that goes beyond syntax and how-to manuals and teaches you how to think like a great Kotlin developer…."}, {"book_title": "3D Printing for Architects with MakerBot", "book_author": "Matthew B. Stokes", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/03/3D-Printing-for-Architects-with-MakerBot-400x493.jpg", "book_content": "Recently we\u0092ve seen consumer 3D printing gaining traction. The power of 3D printing is huge and its applications are seemingly endless\u0097medicine, architecture, and food, to name a few. Incorporating 3D printing into your design cycle reduces overall project costs and lowers project duration, as it allows for rapid…"}, {"book_title": "iCloud Standard Guide", "book_author": "Andri Yadi", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/03/iCloud-Standard-Guide-400x493.jpg", "book_content": "iCloud is a cloud storage and cloud computing service from Apple Inc. iCloud is a hub in a multi-devices environment, that allows your iPads, iPhones, iPod Touches, and Macs sync with each other and always have the same content. The service allows users to store data, such as…"}, {"book_title": "Android Espresso Revealed", "book_author": "Denys Zelenchuk", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/03/Android-Espresso-Revealed.jpg", "book_content": "Write Android user interface (UI) tests using Google Espresso for Android. You’ll cover all the major topics of writing functional UI automated tests using the Espresso testing framework, including different ways of running automated tests, architecting test projects in an easy and maintainable way, and using tools which…"}, {"book_title": "Cyber Operations, 2nd Edition", "book_author": "Mike O'Leary", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/03/Cyber-Operations.jpg", "book_content": "Know how to set up, defend, and attack computer networks with this revised and expanded second edition. You will learn to configure your network from the ground up, beginning with developing your own private virtual test environment, then setting up your own DNS server and AD infrastructure. You…"}, {"book_title": "Search Engine Optimization Bible, 2nd Edition", "book_author": "Jerri L. Ledford", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/03/Search-Engine-Optimization-Bible-2nd-Edition.jpg", "book_content": "Detailed, practical guide to increasing your Web traffic through better search results Wonder how some companies pop up high in search engine rankings? It’s all about search appeal. Master the strategies, techniques, and shortcuts in this detailed guide and you can improve your Web site’s search rankings and…"}, {"book_title": "The Definitive Guide to db4o", "book_author": "Jim Paterson", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/The-Definitive-Guide-to-db4o.jpg", "book_content": "This is the first book to cover db4o programming in comprehensive detail. Readers are briefed on all of the topics necessary to begin using it in production environments, including installation and configuration, querying and managing objects, performing transactions, and data replication. Newcomers to the topic aren’t forgotten, as…"}, {"book_title": "Introducing Python", "book_author": "Bill Lubanovic", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/Introducing-Python.jpg", "book_content": "Easy to understand and fun to read, Introducing Python is ideal for beginning programmers as well as those new to the language. Author Bill Lubanovic takes you from the basics to more involved and varied topics, mixing tutorials with cookbook-style code recipes to explain concepts in Python 3…."}, {"book_title": "Oracle Database 12c Release 2 Multitenant", "book_author": "Anton Els", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/Oracle-Database-12c-Release-2-Multitenant-400x493.jpg", "book_content": "Master the Powerful Multitenant Features of Oracle Database 12c Govern a scalable, extensible, and highly available enterprise database environment using the practical information contained in this Oracle Press guide. Written by a team of Oracle Masters, Oracle Database 12c Release 2 Multitenant shows, step-by-step, how to deploy and manage multitenant…"}, {"book_title": "Practical Machine Learning and Image Processing", "book_author": "Himanshu Singh", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/Practical-Machine-Learning-and-Image-Processing.jpg", "book_content": "Gain insights into image-processing methodologies and algorithms, using machine learning and neural networks in Python. This book begins with the environment setup, understanding basic image-processing terminology, and exploring Python concepts that will be useful for implementing the algorithms discussed in the book. You will then cover all the…"}, {"book_title": "Digital Forensics Basics", "book_author": "Nihad A. Hassan", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/Digital-Forensics-Basics.jpg", "book_content": "Use this hands-on, introductory guide to understand and implement digital forensics to investigate computer crime using Windows, the most widely used operating system. This book provides you with the necessary skills to identify an intruder’s footprints and to gather the necessary digital evidence in a forensically sound manner…"}, {"book_title": "Blockchain Enabled Applications", "book_author": "David Metcalf", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/Blockchain-Enabled-Applications.jpg", "book_content": "Work with blockchain and understand its potential application beyond cryptocurrencies in the domains of healthcare, Internet of Things, finance, decentralized organizations, and open science. Featuring case studies and practical insights generated from a start-up spun off from the author’s own lab, this book covers a unique mix of…"}, {"book_title": "Mastering Prezi for Business Presentations, 2nd Edition", "book_author": "J.J. Sylvia IV", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/Mastering-Prezi-for-Business-Presentations-2nd-Edition-400x493.jpg", "book_content": "Prezi is a tool for delivering presentations in a linear or non-linear format. This cloud-based software enables users to structure presentations on an infinite canvas in a way that is more engaging and visually stimulating to the audience. This book covers all of the technical elements of the…"}, {"book_title": "JBoss Tools 3 Developers Guide", "book_author": "Anghel Leonard", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/JBoss-Tools-3-Developers-Guide.jpg", "book_content": "Since these technologies covered are different from each other, they are covered in separate chapters that are not interdependent; therefore you can learn to use whichever tool you want, without exploring the previous chapters. This approach sustains the learning per example paradigm and helps you to use the…"}, {"book_title": "Learn Office 2016 for Mac, 2nd Edition", "book_author": "Guy Hart-Davis", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/Learn-Office-2016-for-Mac-2nd-Edition1.jpg", "book_content": "A practical, hands-on approach to using Office 2016 applications to create and edit documents and get work done efficiently. You’ll learn how to customize Office, design, create, and share documents, manipulate data in a spreadsheet, and create lively presentations. You’ll also discover how to organize your email, contacts,…"}, {"book_title": "Build Mobile Apps with Ionic 4 and Firebase", "book_author": "Fu Cheng", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/Build-Mobile-Apps-with-Ionic-4-and-Firebase.jpg", "book_content": "Leverage your existing web development skills to learn the whole cycle of hybrid mobile app development. This edition is fully updated with the changes in Ionic 4, including Stencil, a new framework based on the web components standard. It explains Ionic and Firebase in detail, including how to create hybrid…"}, {"book_title": "Beginning Sensor Networks with Arduino and Raspberry Pi", "book_author": "Charles Bell", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/Beginning-Sensor-Networks-with-Arduino-and-Raspberry-Pi.jpg", "book_content": "Beginning Sensor Networks with Arduino and Raspberry Pi teaches you how to build sensor networks with Arduino, Raspberry Pi, and XBee radio modules, and even shows you how to turn your Raspberry Pi into a MySQL database server to store your sensor data! First you’ll learn about the different…"}, {"book_title": "Learning Bing Maps API", "book_author": "Artan Sinani", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/Learning-Bing-Maps-API-400x493.jpg", "book_content": "Provided as a part of Microsoft’s Bing suite of search engines, Bing Maps is a web mapping service powered by the Bing Maps for Enterprise framework. The need for geospatial data has increased dramatically in the last few years. Adding a mapping context to any location-based data is…"}, {"book_title": "Computer Vision Metrics", "book_author": "Scott Krig", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/Computer-Vision-Metrics.jpg", "book_content": "Computer Vision Metrics provides an extensive survey and analysis of over 100 current and historical feature description and machine vision methods, with a detailed taxonomy for local, regional and global features. This book provides necessary background to develop intuition about why interest point detectors and feature descriptors actually work,…"}, {"book_title": "PostGIS Cookbook", "book_author": "Bborie Park", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/PostGIS-Cookbook-400x493.jpg", "book_content": "PostGIS is a spatial database that integrates advanced storage and analysis of vector and raster data, and is remarkably flexible and powerful. PostGIS provides support for geographic objects to the PostgreSQL object-relational database and is currently the most popular open source spatial databases. If you want to explore…"}, {"book_title": "Beginning REALbasic", "book_author": "Jerry Lee Ford Jr.", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/Beginning-REALbasic.jpg", "book_content": "If youre just getting into programming, or youre already an experienced VB programmer who wants to quickly learn a programming alternative, then REALbasic is the ideal language for you. REALbasic is an easy-to-learn, powerful, cross-platform programming language that allows you to write powerful applications that may be distributed…"}, {"book_title": "DNS in Action", "book_author": "Alena Kabelov¿", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/DNS-in-Action.jpg", "book_content": "What This Book Covers Chapter 1 begins to explain basic DNS principles. It introduces essential names, for example,domain and zone, explaining the difference between them. It describes the iteration principle by which the DNS translates names to IP addresses. It presents a configuration of a resolver both for…"}, {"book_title": "Mastering Ethereum", "book_author": "Andreas M. Antonopoulos", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/Mastering-Ethereum.jpg", "book_content": "If you’re looking to get started with the Ethereum protocol–or are among the many open source developers, integrators, and system administrators already working with this platform–Mastering Ethereum is the definitive book on the topic. Ethereum represents the gateway to a worldwide, decentralized computing paradigm. This platform enables you to…"}, {"book_title": "Java in a Nutshell, 7th Edition", "book_author": "Ben Evans", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/Java-in-a-Nutshell-7th-Edition.jpg", "book_content": "This updated edition of Java in a Nutshell not only helps experienced Java programmers get the most out of Java versions 9 through 11, it’s also a learning path for new developers. Chock full of examples that demonstrate how to take complete advantage of modern Java APIs and development best…"}, {"book_title": "Instant Haml", "book_author": "Krzysztof Niksinskiis", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/Instant-Haml-400x493.jpg", "book_content": "Haml is a markup language used to rapidly develop Rails view templates (or HTML pages). It is used by professional developers and praised for its cleanliness, human friendliness and usage agility. It functions as a replacement for inline page templating systems such as PHP, ASP, and ERB –…"}, {"book_title": "iWork 09 For Dummies", "book_author": "Jesse Feiler", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/iWork-09-For-Dummies.jpg", "book_content": "Dress up office documents the Apple way with iWork ’09 and this friendly guide If you’re a Mac lover and want to explore life outside of that “other productivity suite,” here’s your chance to dress up your docs with Apple’s iWork ’09 and this easy-to-follow guide from Mac…"}, {"book_title": "Microsoft Project 2019 For Dummies", "book_author": "Cynthia Snyder Dionisio", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/Microsoft-Project-2019-For-Dummies.jpg", "book_content": "Keep projects on track Microsoft Project 2019 is a powerhouse project management, portfolio management, and resource management tool. Whether you’re a full-time project manager or manage projects as part of a larger set of duties, Microsoft Project 2019 For Dummies will get you thinking and operating at the level of a…"}, {"book_title": "Learn to Program with Scratch", "book_author": "Majed Marji", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/Learn-to-Program-with-Scratch.jpg", "book_content": "Scratch is a fun, free, beginner-friendly programming environment where you connect blocks of code to build programs. While most famously used to introduce kids to programming, Scratch can make computer science approachable for people of any age. Rather than type countless lines of code in a cryptic programming…"}, {"book_title": "iOS Development with Swift", "book_author": "Craig Grummit", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/iOS-Development-with-Swift.jpg", "book_content": "iOS Development with Swift is a hands-on guide to creating apps for iPhone and iPad using the Swift language. Inside, you’ll be guided through every step of the process for building an app, from first idea to App Store. This book fully covers Swift 4, Xcode 9, and iOS…"}, {"book_title": "Serverless Applications with Node.js", "book_author": "Aleksandar Simovic", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/Serverless-Applications-with-Nodejs.jpg", "book_content": "Serverless Applications with Node.js walks you through building serverless apps on AWS using JavaScript. Inside, you’ll discover what Claudia.js brings to the table as you build and deploy a scalable event-based serverless application, based around a pizzeria that’s fully integrated with AWS services, including Lambda and API Gateway. Each…"}, {"book_title": "Gitolite Essentials", "book_author": "Sitaram Chamarty", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/Gitolite-Essentials-400x493.jpg", "book_content": "If you’re responsible for securing a Git server where lots of developers work with lots of repositories, you have a problem on your hands. You probably want to implement security restrictions and authorization for certain repositories. You will love the simplicity and power of Gitolite’s access control language…"}, {"book_title": "Elasticsearch: The Definitive Guide", "book_author": "Clinton Gormley", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/Elasticsearch-The-Definitive-Guide.jpg", "book_content": "Whether you need full-text search or real-time analytics of structured data—or both—the Elasticsearch distributed search engine is an ideal way to put your data to work. This practical guide not only shows you how to search, analyze, and explore data with Elasticsearch, but also helps you deal with…"}, {"book_title": "Apache Solr High Performance", "book_author": "Surendra Mohan", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/Apache-Solr-High-Performance-400x494.jpg", "book_content": "Apache Solr is one of the most popular open source search servers available on the web. However, simply setting up Apache Solr is not enough to ensure the success of your web product. To maximize efficiency, you need to use techniques to boost Solr performance in order to…"}, {"book_title": "Windows Server 2008 All-In-One Desk Reference For Dummies", "book_author": "John Paul Mueller", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/Windows-Server-2008-All-In-One-Desk-Reference-For-Dummies.jpg", "book_content": "If you’ve been waiting impatiently for the arrival of Windows Server 2008, wait no more! It’s here, and so is Windows Server 2008 All-In-One Desk Reference For Dummies to help you install it, configure it, network with it, secure it, command it with Windows PowerShell, and more. Services best practices…"}, {"book_title": "Building Xamarin.Forms Mobile Apps Using XAML", "book_author": "Dan Hermes", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/Building-Xamarin.Forms-Mobile-Apps-Using-XAML.jpg", "book_content": "Leverage Xamarin.Forms to build iOS and Android apps using a single, cross-platform approach. This book is the XAML companion to the C# guide Xamarin Mobile Application Development. You’ll begin with an overview of Xamarin.Forms, then move on to an in-depth XAML (eXtensible Application Markup Language) primer covering syntax, namespaces,…"}, {"book_title": "Mastering Grunt", "book_author": "Daniel Li", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/Mastering-Grunt-400x493.jpg", "book_content": "Grunt.js continues to excel as the build automation tool of choice. Along with its support for many third-party technologies, Grunt is packaged with a clean API for defining tasks. This powerful tool can streamline your workflow by automating the preparation tasks for production, such as compression, compilation, obfuscation,…"}, {"book_title": "Android 3.0 Application Development Cookbook", "book_author": "Merrifield Mew Kyle", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/Android-3.0-Application-Development-Cookbook-400x494.jpg", "book_content": "Android is a mobile operating system that runs on a staggering number of smartphones and tablets. Android offers developers the ability to build extremely rich and innovative applications written using the Java programming language. Among the number of books that have been published on the topic, what’s missing…"}, {"book_title": "PostgreSQL Replication", "book_author": "Hans-Jürgen Schönig", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/PostgreSQL-Replication-400x493.jpg", "book_content": "PostgreSQL offers a comprehensive set of replication related features, which can be used to make your database servers more robust and way more scalable. Unleashing the power of PostgreSQL provides the user with countless opportunities and a competitive advantage over other database systems. To make things more powerful,…"}, {"book_title": "HBase Administration Cookbook", "book_author": "Yifeng Jiang", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/HBase-Administration-Cookbook-400x494.jpg", "book_content": "As an Open Source distributed big data store, HBase scales to billions of rows, with millions of columns and sits on top of the clusters of commodity machines. If you are looking for a way to store and access a huge amount of data in real-time, then look…"}, {"book_title": "Microsoft 365 Business for Admins For Dummies", "book_author": "Jennifer Reed", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/Microsoft-365-Business-for-Admins-For-Dummies.jpg", "book_content": "Learn streamlined management and maintenance capabilities for Microsoft 365 Business If you want to make it easy for your teams to work together using the latest productivity solutions with built-in security—while saving thousands of dollars in implementing the solution—you’ve picked the right book. Inside, you’ll gain an understanding…"}, {"book_title": "Tableau For Dummies", "book_author": "Molly Monsey", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/Tableau-For-Dummies-400x498.jpg", "book_content": "Make your data work for you! Tableau For Dummies brings order to the chaotic world of data. Understanding your data and organizing it into formats and visualizations that make sense to you are crucial to making a real impact on your business with the information that’s already at your…"}, {"book_title": "Starting Out with Java Early Objects, 5 edition", "book_author": "Tony Gaddis", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/Starting-Out-with-Java-Early-Objects-400x500.jpg", "book_content": "Tony Gaddis’s accessible, step-by-step presentation helps beginning students understand the important details necessary to become skilled programmers at an introductory level. Gaddis motivates the study of both programming skills and the Java programming language by presenting all the details needed to understand the “how” and the “why”—but never…"}, {"book_title": "Starting Out With App Inventor for Android", "book_author": "Tony Gaddis", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/Starting-Out-With-App-Inventor-for-Android-400x500.jpg", "book_content": "In Starting Out with App Inventor for Android, Tony Gaddis and Rebecca Halsey teach the fundamentals of programming while simultaneously showing students how to create fun, useful, and imaginative apps. Because App Inventor allows students to create apps and see them running on a phone, programming becomes a…"}, {"book_title": "StumbleUpon For Dummies", "book_author": "Nick Robinson", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/StumbleUpon-For-Dummies.jpg", "book_content": "Discover new and interesting online content based on your interests! StumbleUpon helps you discover new and interesting content on the Internet based on your specific interests. With this helpful For Dummies guide, you will learn to complete a profile that alerts StumbleUpon what topics interest you and assists in making…"}, {"book_title": "Twitter For Dummies, 2nd Edition", "book_author": "Jack Dorsey", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/Twitter-For-Dummies-2nd-Edition.jpg", "book_content": "A fully updated guide to the how and why of using Twitter The fastest-growing social network utility sports new features, and they’re all covered in this how-to guide from a leading Twitter marketing consultant. Nearly 20 million people are tweeting on Twitter, and this book shows you how…"}, {"book_title": "macOS Sierra", "book_author": "David Pogue", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/macOS-Sierra.jpg", "book_content": "With Sierra, Apple brings never-before-seen features to macOS—like Siri voice control, file sharing across all your iOS devices, picture-in-picture mode for iTunes and Safari, and AI photo search. Once again, David Pogue brings his humor and expertise to the #1 bestselling Mac book. Whether you’re a developer or…"}, {"book_title": "Surface For Dummies", "book_author": "Andy Rathbone", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/Surface-For-Dummies.jpg", "book_content": "Clear the surface and make way for the new tablet from Microsoft! As Microsoft’s first foray into the tablet market, the Surface is packed with all the features you’re looking for to stay entertained and get things done wherever you go. Written by bestselling veteran author Andy Rathbone, this full-color, easy-to-understand book…"}, {"book_title": "Android Tablets For Dummies, 2nd Edition", "book_author": "Dan Gookin", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/Android-Tablets-For-Dummies-2nd-Edition-400x498.jpg", "book_content": "Make your Android do your bidding with help from bestselling author Dan Gookin Congratulations on your new Android tablet! Whether you’re new to Android or new to tablets altogether, you’re about to experience mobile computing like never before with this fun, full-color guide. Written in the trademark For Dummies style,…"}, {"book_title": "iPad For Dummies, 7th Edition", "book_author": "Bob LeVitus", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/iPad-For-Dummies-7th-Edition-400x498.jpg", "book_content": "The fast and easy way to get the most out of your iPad – updated for iPad Air 2 and iPad mini 3! This new edition of iPad For Dummies covers all the latest tips and tricks to getting the most out of your iPad, presented in a straightforward-but-fun language…"}, {"book_title": "iPad in Education For Dummies", "book_author": "Sam Gliksman", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/iPad-in-Education-For-Dummies-400x498.jpg", "book_content": "It’s easy to bring the incredible iPad experience to your classroom today! The iPad is a natural fit for education in the 21st century, and this straightforward, full-color guide shows you just how to deploy it effectively in your educational institution. From understanding how iPads can be used…"}, {"book_title": "iPad For Seniors For Dummies, 6th Edition", "book_author": "Nancy C. Muir", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/iPad-For-Seniors-For-Dummies-6th-Edition.jpg", "book_content": "Discover all the incredible things your iPad can do! So you have an iPad and you’re excited to use it, but where do you begin? With this fun and friendly guide, of course! Veteran For Dummies author Nancy Muir walks you through using your iPad for e-mail, video, travel, navigation,…"}, {"book_title": "Laptops For Seniors For Dummies, 3rd Edition", "book_author": "Nancy C. Muir", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/Laptops-For-Seniors-For-Dummies-3rd-Edition.jpg", "book_content": "It’s never too late to get up and running on a laptop Just bought your first laptop and not sure where to start? Here’s the book you need. Easy-to-follow instructions (plus really easy-to-read fonts!) help you unlock the most convenient and fun aspects to using a laptop. Get…"}, {"book_title": "PCs Just the Steps For Dummies, 2nd Edition", "book_author": "Nancy C. Muir", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/PCs-Just-the-Steps-For-Dummies-2nd-Edition-400x320.jpg", "book_content": "If you’re looking for step-by-step instructions for learning a PC, PCs Just The Steps For Dummies, 2nd Edition, has exactly what you need. Author Nancy Muir knows how to get PC beginners up to speed in a hurry, the fun and easy way. No lengthy theory here; Just the Steps…"}, {"book_title": "Functional Programming For Dummies", "book_author": "John Paul Mueller", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/Functional-Programming-For-Dummies.jpg", "book_content": "Your guide to the functional programming paradigm Functional programming mainly sees use in math computations, including those used in Artificial Intelligence and gaming. This programming paradigm makes algorithms used for math calculations easier to understand and provides a concise method of coding algorithms by people who aren’t developers. Current…"}, {"book_title": "Blazor Revealed", "book_author": "Peter Himschoot", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/Blazor-Revealed.jpg", "book_content": "Build web applications in Microsoft .NET that run in any modern browser, helping you to transfer your .NET experience and skills to a new environment and build browser-based applications using a robust and type-safe language and runtime. Developing a web site with rich client-side behavior means most developers…"}, {"book_title": "Ubuntu Made Easy", "book_author": "Phil Bull", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/Ubuntu-Made-Easy.jpg", "book_content": "Ubuntu brings Linux to the masses, but it can still be intimidating for newbies, neophytes, and geeks-in-training. With Ubuntu Made Easy by your side you’ll be ready to face any challenge, and you’ll discover just how fun Linux can be.Packed with tips, tricks, and helpful pointers, Ubuntu Made…"}, {"book_title": "MATLAB Machine Learning Recipes, 2nd Edition", "book_author": "Michael Paluszek", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/MATLAB-Machine-Learning-Recipes.jpg", "book_content": "Harness the power of MATLAB to resolve a wide range of machine learning challenges. This book provides a series of examples of technologies critical to machine learning. Each example solves a real-world problem. All code in MATLAB Machine Learning Recipes:  A Problem-Solution Approach is executable. The toolbox that the code…"}, {"book_title": "Reactive Streams in Java", "book_author": "Adam L. Davis", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/02/Reactive-Streams-in-Java.jpg", "book_content": "Get an easy introduction to reactive streams in Java to handle concurrency, data streams, and the propagation of change in today’s applications. This compact book includes in-depth introductions to RxJava, Akka Streams, and Reactor, and integrates the latest related features from Java 9 and 11, as well as reactive…"}, {"book_title": "Elixir in Action, 2nd Edition", "book_author": "Saša Jurić", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/01/Elixir-in-Action-2nd-Edition.jpg", "book_content": "The Elixir language blends the battle-tested power and stability of the Erlang virtual machine with an approachable and expressive syntax. Elixir in Action, Second Edition teaches you how to use the Elixir programming language to solve the practical problems of scalability, fault tolerance, and high availability. This new edition…"}, {"book_title": "Natural Language Processing Recipes", "book_author": "Adarsha Shivananda", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/01/Natural-Language-Processing-Recipes.jpg", "book_content": "Implement natural language processing applications with Python using a problem-solution approach. This book has numerous coding exercises that will help you to quickly deploy natural language processing techniques, such as text classification, parts of speech identification, topic modeling, text summarization, text generation, entity extraction, and sentiment analysis. Natural…"}, {"book_title": "Securing Office 365", "book_author": "Matthew Katzer", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/01/Securing-Office-365.jpg", "book_content": "Understand common security pitfalls and discover weak points in your organization’s data security, and what you can do to combat them. This book includes the best approaches to managing mobile devices both on your local network and outside the office. Data breaches, compliance fines,  and distribution  of personally…"}, {"book_title": "Manga Studio For Dummies", "book_author": "Doug Hills", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/01/Manga-Studio-For-Dummies.jpg", "book_content": "Love Manga? The newest features of Manga Studio help you bring your ideas to life! The tools available in the latest version of this powerful program make it easy to turn your computer into your drawing board, and Manga Studio For Dummies makes it easy to get started. Discover how…"}, {"book_title": "Fonts & Encodings", "book_author": "P Scott Horne", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/01/Fonts-Encodings.jpg", "book_content": "This reference is a fascinating and complete guide to using fonts and typography on the Web and across a variety of operating systems and application software. Fonts & Encodings shows you how to take full advantage of the incredible number of typographic options available, with advanced material that covers everything…"}, {"book_title": "PyTorch Recipes", "book_author": "Pradeepta Mishra", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/01/PyTorch-Recipes.jpg", "book_content": "Get up to speed with the deep learning concepts of Pytorch using a problem-solution approach. Starting with an introduction to PyTorch, you’ll get familiarized with tensors, a type of data structure used to calculate arithmetic operations and also learn how they operate. You will then take a look…"}, {"book_title": "JavaScript Data Structures and Algorithms", "book_author": "Sammie Bae", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/01/JavaScript-Data-Structures-and-Algorithms.jpg", "book_content": "Explore data structures and algorithm concepts and their relation to everyday JavaScript development. A basic understanding of these ideas is essential to any JavaScript developer wishing to analyze and build great software solutions. You’ll discover how to implement data structures such as hash tables, linked lists, stacks, queues,…"}, {"book_title": "Learn Robotics with Raspberry Pi", "book_author": "Matt Timmons-Brown", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/01/Learn-Robotics-with-Raspberry-Pi.jpg", "book_content": "In Learn Robotics with Raspberry Pi, you’ll learn how to build and code your own robot projects with just the Raspberry Pi microcomputer and a few easy-to-get components – no prior experience necessary! Learn Robotics with Raspberry Pi will take you from inexperienced maker to robot builder. You’ll start off…"}, {"book_title": "Practical Recommender Systems", "book_author": "Kim Falk", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/01/Practical-Recommender-Systems.jpg", "book_content": "Recommender systems are practically a necessity for keeping a site’s content current, useful, and interesting to visitors. Recommender systems are everywhere, helping you find everything from movies to jobs, restaurants to hospitals, even romance. Practical Recommender Systems goes behind the curtain to show readers how recommender systems work and,…"}, {"book_title": "Practical Windows Forensics", "book_author": "Ayman Shaaban", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/01/Practical-Windows-Forensics-400x493.jpg", "book_content": "Over the last few years, the wave of the cybercrime has risen rapidly. We have witnessed many major attacks on the governmental, military, financial, and media sectors. Tracking all these attacks and crimes requires a deep understanding of operating system operations, how to extract evident data from digital…"}, {"book_title": "Dependency Injection", "book_author": "Dhanji R. Prasanna", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/01/Dependency-Injection.jpg", "book_content": "Dependency Injection is an in-depth guide to the current best practices forusing the Dependency Injection pattern-the key concept in Spring and therapidly-growing Google Guice. It explores Dependency Injection, sometimescalled Inversion of Control, in fine detail with numerous practical examples.Developers will learn to apply important techniques, focusing on their strengthsand…"}, {"book_title": "Mule in Action", "book_author": "David Dossot", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/01/Mule-in-Action.jpg", "book_content": "Mule is the most widely used open source ESB-with millions of downloads-providing an alternative to expensive commercial options. Mule in Action is acomprehensive tutorial designed for working Java developers. This authoritativebook explores the architecture and the main features of version Mule 2 throughnumerous running examples. It starts with…"}, {"book_title": "NHibernate in Action", "book_author": "Christian Bauer", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/01/NHibernate-in-Action.jpg", "book_content": "In the classic style of Manning’s “In Action” series, NHibernate in Action shows.NET developers how to use the NHibernate Object/Relational Mapping tool.This book is a translation from Java to .NET, as well as an expansion, ofManning’s bestselling Hibernate in Action. All traces of Java have been carefullyreplaced by their .NET equivalents…."}, {"book_title": "Apache Maven 2 Effective Implementation", "book_author": "Brett Porter", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/01/Apache-Maven-2-Effective-Implementation-400x494.jpg", "book_content": "All material in the book will be worked through by example, building up a sample application. It is intended to be read through in sequence, though once complete, should serve as a suitable reference for certain cases that can be referred to directly. This book is for Java…"}, {"book_title": "Beginning PHP and MySQL 5, 2nd Edition", "book_author": "W. Jason Gilmore", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/01/Beginning-PHP-and-MySQL-5-2nd-Edition.jpg", "book_content": "Written for the budding web developer searching for a powerful, low-cost solution for building flexible, dynamic web sites. Essentially three books in one: provides thorough introductions to the PHP language and the MySQL database, and shows you how these two technologies can be effectively integrated to build powerful…"}, {"book_title": "Java XML and JSON, 2nd Edition", "book_author": "Jeff Friesen", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/01/Java-XML-and-JSON-2nd-Edition.jpg", "book_content": "Use this guide to master the XML metalanguage and JSON data format along with significant Java APIs for parsing and creating XML and JSON documents from the Java language. New in this edition is coverage of Jackson (a JSON processor for Java) and Oracle’s own Java API for…"}, {"book_title": "Large Scale Data Analytics", "book_author": "Amandeep S. Sidhu", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/01/Large-Scale-Data-Analytics.jpg", "book_content": "This book presents a language integrated query framework for big data. The continuous, rapid growth of data information to volumes of up to terabytes (1,024 gigabytes) or petabytes (1,048,576 gigabytes) means that the need for a system to manage and query information from large scale data sources is…"}, {"book_title": "Java Programming, 9th Edition", "book_author": "Joyce Farrell", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/01/Java-Programming-9th-Edition-400x495.jpg", "book_content": "Discover the power of Java™ for developing applications today when you trust the engaging, hands-on approach in Farrell’s JAVA PROGRAMMING, 9E. Even if you’re a first-time programmer, JAVA PROGRAMMING can show you how to quickly start developing useful programs, all while still mastering the basic principles of structured…"}, {"book_title": "Linux Networking Cookbook", "book_author": "Gregory Boyce", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/01/Linux-Networking-Cookbook-400x493.jpg", "book_content": "Linux can be configured as a networked workstation, a DNS server, a mail server, a firewall, a gateway router, and many other things. These are all part of administration tasks, hence network administration is one of the main tasks of Linux system administration. By knowing how to configure…"}, {"book_title": "Microsoft SQL Server 2008, Second Edition", "book_author": "William R. Stanek", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/01/Microsoft-SQL-Server-2008-Second-Edition.jpg", "book_content": "From the author and series editor of the immensely popular ADMINISTRATOR’S POCKET CONSULTANT series from Microsoft Press®-this pocket-size guide delivers fast, accurate answers on the spot for IT professionals. Microsoft® SQL Server® 2008 Administrator’s Pocket Consultant, 2nd Edition is the ideal concise, immediate reference you’ll want with you…"}, {"book_title": "Sams Teach Yourself Database Programming with Visual C++ 6 in 21 Days", "book_author": "Lyn Robinson", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/01/Sams-Teach-Yourself-Database-Programming-with-Visual-C-6-in-21-Days.jpg", "book_content": "Shows readers how to use Visual C++++ 6 to improve their database programming, how to add “universal data access” to their applications, and how to use the design tools of SQL Server and component technologies such as ADO. Original. (Intermediate)."}, {"book_title": "SharePoint 2013 For Dummies", "book_author": "Ken Withee", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/01/SharePoint-2013-For-Dummies.jpg", "book_content": "The bestselling guide on running SharePoint, now updated tocover all the new features of SharePoint 2013 SharePoint Portal Server is an essential part of the enterpriseinfrastructure for many businesses. Building on the success ofprevious versions of SharePoint For Dummies, this newedition covers all the latest features of SharePoint 2013…"}, {"book_title": "ASP.NET 3.5 Website Programming", "book_author": "Chris Love", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/01/ASP.NET-3.5-Website-Programming.jpg", "book_content": "Uses the popular Problem;Design;Solution format to help readers, especially those who know how to code specific ASP.NET features, learn to “put it all together” into a complete Web application Emphasizes n-tier ASP.NET Web application architectural design, something intermediate and advanced ASP.NET developers need and can’t find anywhere else…"}, {"book_title": "Visual C# 2005 Demystified", "book_author": "Jeff Kent", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/01/Visual-C-2005-Demystified-400x496.jpg", "book_content": "There’s no easier, faster, or more practical way to learn the really tough subjects Visual C# 2005 Demystified explains the language and its libraries and applications as well as how to use the integrated development environment. This self-teaching guide comes complete with key points, background information, quizzes at…"}, {"book_title": "Cisco Secure Internet Security Solutions", "book_author": "Andrew Mason", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/01/Cisco-Secure-Internet-Security-Solutions.jpg", "book_content": "At present, no available publication deals with Internet security from a Cisco perspective utilizing the Cisco Secure product family. Cisco Secure Internet Security Solutions covers the basics of Internet security and then concentrates on each member of the Cisco Secure product family, providing a rich explanation with examples…"}, {"book_title": "Professional LINQ", "book_author": "Scott Klein", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/01/Professional-LINQ.jpg", "book_content": "Professional LINQ introduces experienced programmers and database developers to LINQ database queries in their native VB and C# languages. Some of the topics covered include: LINQ Queries LINQ and the Standard Query Operators Programming with XLinq Querying XML with XLinq Mixing XML and other data models DLinq and…"}, {"book_title": "Cisco ISP Essentials", "book_author": "Barry Raveendran Greene", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/01/Cisco-ISP-Essentials.jpg", "book_content": "A comprehensive guide to the best common practices for Internet service providers Learn the best common practices for configuring routers on the Internet from experts who helped build the Internet Gain specific advice through comprehensive coverage of all Cisco routers and current versions of Cisco IOS Software Understand…"}, {"book_title": "Parallel Programming with Microsoft Visual Studio 2010 Step by Step", "book_author": "Donis Marshall", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/01/Parallel-Programming-with-Microsoft-Visual-Studio-2010-Step-by-Step-400x484.jpg", "book_content": "Your hands-on, step-by-step guide to the fundamentals of parallel programming Teach yourself how to help improve application performance by using parallel programming techniques in Visual Studio 2010—one step at a time. Ideal for experienced programmers with little or no parallel programming experience, this tutorial provides practical, learn-by-doing exercises…"}, {"book_title": "Practical Application Development with AppRun", "book_author": "Yiyi Sun", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/01/Practical-Application-Development-with-AppRun.jpg", "book_content": "Explore the concepts, patterns, and architecture behind AppRun applications. With this end-to-end guide, you will be able to build web apps fast to the market with the low learning curve and high development productivity. You will learn how to break down the application logic into three decoupled parts:…"}, {"book_title": "Borland C++ Builder", "book_author": "Gregory L. Guntle", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/01/Borland-C-Builder.jpg", "book_content": "Best-selling programming author Herb Schildt brings you the most comprehensive resource to Borland C++ Builder available. Including complete coverage of the C++ language, tools, libraries–plus an introduction to Windows programming–this book contains everything you need to know to expertly work with Borland C++."}, {"book_title": "Solving Cyber Risk", "book_author": "Andrew Coburn", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/01/Solving-Cyber-Risk.jpg", "book_content": "The non-technical handbook for cyber security risk management Solving Cyber Risk distills a decade of research into a practical framework for cyber security. Blending statistical data and cost information with research into the culture, psychology, and business models of the hacker community, this book provides business executives, policy-makers, and individuals with…"}, {"book_title": "Mastering OpenLDAP", "book_author": "Matt Butcher", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/01/Mastering-OpenLDAP.jpg", "book_content": "This book is the ideal introduction to using OpenLDAP for Application Developers and will also benefit System Administrators running OpenLDAP. It prepares the reader to build a directory using OpenLDAP, and then employ this directory in the context of the network, taking a practical approach that emphasizes how…"}, {"book_title": "JUnit in Action, Second Edition", "book_author": "Felipe Leme", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/01/JUnit-in-Action-Second-Edition.jpg", "book_content": "When JUnit was first introduced a decade ago by Kent Beck and Erich Gamma, the Agile movement was in its infancy, “Test Driven Development” was unknown, and unit testing was just starting to move into the typical developer’s vocabulary. Today, most developers acknowledge the benefits of unit testing…"}, {"book_title": "Nagios, 2nd Edition", "book_author": "Wolfgang Barth", "book_img": "http://www.allitebooks.com/wp-content/uploads/2019/01/Nagios-2nd-Edition.jpg", "book_content": "Good system administrators recognize problems long before anyone asks, “Hey, is the Internet down?” Nagios, an open source system and network monitoring tool, has emerged as the most popular solution for sys admins in organizations of all sizes. It’s robust but also complex, and Nagios: System and Network Monitoring,…"}, {"book_title": "PHP 5 Objects, Patterns, and Practice", "book_author": "Matt Zandstra", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/12/PHP-5-Objects-Patterns-and-Practice.jpg", "book_content": "PHP 5’s object-oriented enhancements are among the most significant improvements in the 10+ year history of the language. This book introduces you to those features and the many opportunities they provide, as well as a number of tools that will help you maximize development efforts. The book begins…"}, {"book_title": "Python Continuous Integration and Delivery", "book_author": "Moritz Lenz", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/12/Python-Continuous-Integration-and-Delivery.jpg", "book_content": "Gain the techniques and tools that enable a smooth and efficient software development process in this quick and practical guide on Python continuous integration (CI) and continuous delivery (CD). Based on example applications, this book introduces various kinds of testing and shows you how to set up automated…"}, {"book_title": "Modern C Quick Syntax Reference, 2nd Edition", "book_author": "Mikael Olsson", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/12/Modern-C-Quick-Syntax-Reference-2nd-Edition.jpg", "book_content": "Discover how C’s efficiency makes it a popular choice in a wide variety of applications and operating systems with special applicability to wearables, game programming, system level programming, embedded device/firmware programming and in Arduino and related electronics hobbies in this condensed code and syntax guide. This book presents…"}, {"book_title": "QuickBooks 2019 All-in-One For Dummies", "book_author": "Stephen L. Nelson", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/12/QuickBooks-2019-All-in-One-For-Dummies.jpg", "book_content": "The quickest way to do the books! Finances don’t have to put you in a funk! With the help of this all-encompassing book, you’ll get the easy-to-follow instruction you need to get your business’ ducks in a row—without ever losing your cool. Whether you’re a numbers person or…"}, {"book_title": "Facebook, Twitter, and Instagram For Seniors For Dummies, 3rd Edition", "book_author": "Marsha Collier", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/12/Facebook-Twitter-and-Instagram-For-Seniors-For-Dummies-3rd-Edition.jpg", "book_content": "Enjoy the top social media sites with ease and security Done correctly, social media is a way to connect friends, family, and the world while still maintaining security and privacy. Facebook, Twitter, & Instagram For Seniors For Dummies, 3rd Edition offers advice on how to enjoy the three most popular social…"}, {"book_title": "AWS System Administration", "book_author": "Federico Lucifredi", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/12/AWS-System-Administration.jpg", "book_content": "With platforms designed for rapid adaptation and failure recovery such as Amazon Web Services, cloud computing is more like programming than traditional system administration. Tools for automatic scaling and instance replacement allow even small DevOps teams to manage massively scalable application infrastructures—if team members drop their old views…"}, {"book_title": "BizTalk Server 2016", "book_author": "Agustín Mántaras", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/12/BizTalk-Server-2016.jpg", "book_content": "Gain an in depth view of optimizing the performance of BizTalk Server. This book provides best practices and techniques for improving development of high mission critical solutions.  You’ll see how the BizTalk Server engine works and how to proactively detect and remedy potential bottlenecks before they occur. The book…"}, {"book_title": "Dynamic SQL, 2nd Edition", "book_author": "Edward Pollack", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/12/Dynamic-SQL.jpg", "book_content": "Take a deep dive into the many uses of dynamic SQL in Microsoft SQL Server. This edition has been updated to use the newest features in SQL Server 2016 and SQL Server 2017 as well as incorporating the changing landscape of analytics and database administration. Code examples have…"}, {"book_title": "Numerical Python, 2nd Edition", "book_author": "Robert Johansson", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/12/Numerical-Python-2nd-Edition.jpg", "book_content": "Leverage the numerical and mathematical modules in Python and its standard library as well as popular open source numerical Python packages like NumPy, SciPy, FiPy, matplotlib and more. This fully revised edition, updated with the latest details of each package and changes to Jupyter projects, demonstrates how to…"}, {"book_title": "Hardening Azure Applications, 2nd Edition", "book_author": "Suraj Gaurav", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/12/Hardening-Azure-Applications-2nd-Edition.jpg", "book_content": "Build large-scale, mission-critical hardened applications on the Azure cloud platform. This 2nd edition provides information on the newer features in Azure, such as Linux extensions and supporting Azure Services such as HDInsight and SQL Server on Linux. Updated with new applications Hardening Azure Applications also discusses Scale Sets (VMSS), a…"}, {"book_title": "macOS Mojave For Dummies, 2nd Edition", "book_author": "Bob LeVitus", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/12/macOS-Mojave-For-Dummies-2nd-Edition.jpg", "book_content": "Pro tips for macOS from “Dr. Mac” Your shiny new iMac or trusty old MacBook both rely on macOS to help you get things done. It helps to have an equally reliable guidebook to steer you through the tasks and steps that make macOS run efficiently. This fun and…"}, {"book_title": "The Quick Python Book, 3rd Edition", "book_author": "Naomi Ceder", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/12/The-Quick-Python-Book-3rd-Edition.jpg", "book_content": "This third revision of Manning’s popular The Quick Python Book offers a clear, crisp updated introduction to the elegant Python programming language and its famously easy-to-read syntax. Written for programmers new to Python, this latest edition includes new exercises throughout. It covers features common to other languages concisely, while introducing…"}, {"book_title": "Deep Learning with Python", "book_author": "Francois Chollet", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/12/Deep-Learning-with-Python-400x500.jpg", "book_content": "Deep Learning with Python introduces the field of deep learning using the Python language and the powerful Keras library. Written by Keras creator and Google AI researcher François Chollet, this book builds your understanding through intuitive explanations and practical examples."}, {"book_title": "Linux Basics for Hackers", "book_author": "OccupyTheWeb", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/12/Linux-Basics-for-Hackers.jpg", "book_content": "This practical, tutorial-style book uses the Kali Linux distribution to teach Linux basics with a focus on how hackers would use them. Topics include Linux command line basics, filesystems, networking, BASH basics, package management, logging, and the Linux kernel and drivers. If you’re getting started along the exciting…"}, {"book_title": "Securities Industry Essentials Exam For Dummies with Online Practice", "book_author": "Steven M. Rice", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/12/Securities-Industry-Essentials-Exam-For-Dummies-with-Online-Practice.jpg", "book_content": "Get ready to qualify for the security industry job of your dreams The Securities Industry Essentials (SIE) Exam is a new test administered by FINRA beginning in October 2018. This exam is required as a prerequisite to each series level knowledge exam (such as Series 7). If you’re…"}, {"book_title": "Foundations of PyGTK Development, 2nd Edition", "book_author": "Andrew Krause", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/12/Foundations-of-PyGTK-Development，2nd-Edition.jpg", "book_content": "There are only two mainstream solutions for building the graphical interface of Linux-based desktop applications, and GTK+ (GIMP Toolkit) is one of them. It is a necessary technology for all Linux programmers. This book guides the reader through the complexities of GTK+, laying the groundwork that allows the…"}, {"book_title": "Python for Data Mining Quick Syntax Reference", "book_author": "Valentina Porcu", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/12/Python-for-Data-Mining-Quick-Syntax-Reference.jpg", "book_content": "​Learn how to use Python and its structures, how to install Python, and which tools are best suited for data analyst work. This book provides you with a handy reference and tutorial on topics ranging from basic Python concepts through to data mining, manipulating and importing datasets, and…"}, {"book_title": "Developing Games on the Raspberry Pi", "book_author": "Seth Kenlon", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/12/Developing-Games-on-the-Raspberry-Pi.jpg", "book_content": "Learn to set up a Pi-based game development environment, and then develop a game with Lua, a popular scripting language used in major game frameworks like Unreal Engine (BioShock Infinite), CryEngine (Far Cry series), Diesel (Payday: The Heist), Silent Storm Engine (Heroes of Might and Magic V) and…"}, {"book_title": "Learning PHP, MySQL & JavaScript, 5th Edition", "book_author": "Robin Nixon", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/12/Learning-PHP-MySQL-JavaScript-5th-Edition.jpg", "book_content": "Build interactive, data-driven websites with the potent combination of open source technologies and web standards, even if you have only basic HTML knowledge. In this update to this popular hands-on guide, you’ll tackle dynamic web programming with the latest versions of today’s core technologies: PHP, MySQL, JavaScript, CSS,…"}, {"book_title": "Understanding Azure Data Factory", "book_author": "Abhishek Narain", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/12/Understanding-Azure-Data-Factory.jpg", "book_content": "Improve your analytics and data platform to solve major challenges, including operationalizing big data and advanced analytics workloads on Azure. You will learn how to monitor complex pipelines, set alerts, and extend your organization’s custom monitoring requirements. This book starts with an overview of the Azure Data Factory as a…"}, {"book_title": "Oracle Application Express Forms Converter", "book_author": "Douwe Pieter van den Bos", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/12/Oracle-Application-Express-Forms-Converter.jpg", "book_content": "Packed with plentiful screenshots and clear explanations, this book is a step-by-step tutorial that demonstrates a successful Oracle Forms to Oracle APEX Conversion project. This book is for Oracle Forms developers who want to migrate to Oracle APEX. The book will also be useful for Oracle APEX developers…"}, {"book_title": "Voice User Interface Design", "book_author": "Ritwik Dasgupta", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/12/Voice-User-Interface-Design.jpg", "book_content": "Design and implement voice user interfaces. This guide to VUI helps you make decisions as you deal with the challenges of moving from a GUI world to mixed-modal interactions with GUI and VUI. The way we interact with devices is changing rapidly and this book gives you a…"}, {"book_title": "Building Chatbots with Python", "book_author": "Sumit Raj", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/12/Building-Chatbots-with-Python.jpg", "book_content": "Build your own chatbot using Python and open source tools. This book begins with an introduction to chatbots where you will gain vital information on their architecture. You will then dive straight into natural language processing with the natural language toolkit (NLTK) for building a custom language processing…"}, {"book_title": "Machine Learning with PySpark", "book_author": "Pramod Singh", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/12/Machine-Learning-with-PySpark.jpg", "book_content": "Build machine learning models, natural language processing applications, and recommender systems with PySpark to solve various business challenges. This book starts with the fundamentals of Spark and its evolution and then covers the entire spectrum of traditional machine learning algorithms along with natural language processing and recommender systems…"}, {"book_title": "Understanding Game Application Development", "book_author": "Vincent Maverick S. Durano", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/12/Understanding-Game-Application-Development.jpg", "book_content": "Learn to build a simple data-driven mobile game application using the power of Xamarin.Forms, ASP.NET, the Web API, and SignalR with this short book. In it you will build a cross-platform mobile application that targets both iOS and Android, connect your app with your database using Entity Framework,…"}, {"book_title": "The Well-Grounded Rubyist, 2nd Edition", "book_author": "David A. Black", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/12/The-Well-Grounded-Rubyist-2nd-Edition.jpg", "book_content": "The Well-Grounded Rubyist, Second Edition addresses both newcomers to Ruby as well as Ruby programmers who want to deepen their understanding of the language. This beautifully written and totally revised second edition includes coverage of features that are new in Ruby 2.1, as well as expanded and updated coverage…"}, {"book_title": "Decoupled Drupal in Practice", "book_author": "Preston So", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/12/Decoupled-Drupal-in-Practice.jpg", "book_content": "Gain a clear understanding of the most important concepts in the decoupled CMS landscape. You will learn how to architect and implement decoupled Drupal architectures across the stack―from building the back end and designing APIs to integrating with front-end technologies.  You’ll also review presenting data through consumer applications…"}, {"book_title": "Mining the Social Web, 3rd Edition", "book_author": "Matthew A. Russell", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/12/Mining-the-Social-Web-3rd-Edition.jpg", "book_content": "Mine the rich data tucked away in popular social websites such as Twitter, Facebook, LinkedIn, and Instagram. With the third edition of this popular guide, data scientists, analysts, and programmers will learn how to glean insights from social media—including who’s connecting with whom, what they’re talking about, and…"}, {"book_title": "Effective MySQL Replication Techniques in Depth", "book_author": "Chris Schneider", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/12/Effective-MySQL-Replication-Techniques-in-Depth.jpg", "book_content": "Publisher’s Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. The Essential Guide to Scaling Your Business Solution Written by Oracle ACE Director and MySQL expert Ronald Bradford, with coauthor Chris Schneider, Effective…"}, {"book_title": "Google Voice For Dummies", "book_author": "Bud E. Smith", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/12/Google-Voice-For-Dummies-400x493.jpg", "book_content": "Save time and money with Google’s revolutionary new phone system Google Voice combines existing phone lines, e-mail, and Web access into one central communication channel. Tech industry watchers expect it to give Skype some serious competition, yet little information is available on this new Google service. Google Voice…"}, {"book_title": "UX for Developers", "book_author": "Westley Knight", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/12/UX-for-Developers.jpg", "book_content": "Become more mindful of the user when building digital products, and learn how to integrate a user-centered approach into your thinking as a web or app developer. This book shows you how the user experience is the responsibility of everyone involved in creating the product and how to…"}, {"book_title": "Beginning Functional JavaScript, 2nd Edition", "book_author": "Anto Aravinth", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/12/Beginning-Functional-JavaScript-2nd-Edition.jpg", "book_content": "Understand functional programming concepts and the functional nature of the JavaScript language. Starting with an introduction to functional programming concepts, you will learn the key differences between imperative and functional programming. Diving straight into JavaScript functions, you will learn to write them with ES8. Followed by this you…"}, {"book_title": "Data Wrangling with JavaScript", "book_author": "Ashley Davis", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/12/Data-Wrangling-with-JavaScript.jpg", "book_content": "Data Wrangling with JavaScript is hands-on guide that will teach you how to create a JavaScript-based data processing pipeline, handle common and exotic data, and master practical troubleshooting strategies."}, {"book_title": "SQL For Dummies, 9th Edition", "book_author": "Allen G. Taylor", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/12/SQL-For-Dummies-9th-Edition.jpg", "book_content": "Get ready to make SQL easy! Updated for the latest version of SQL, the new edition of this perennial bestseller shows programmers and web developers how to use SQL to build relational databases and get valuable information from them. Covering everything you need to know to make working…"}, {"book_title": "Think Like a Data Scientist", "book_author": "Brian Godsey", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/12/Think-Like-a-Data-Scientist.jpg", "book_content": "Think Like a Data Scientist presents a step-by-step approach to data science, combining analytic, programming, and business perspectives into easy-to-digest techniques and thought processes for solving real world data-centric problems."}, {"book_title": "Amazon Web Services in Action, 2nd Edition", "book_author": "Andreas Wittig", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/12/Amazon-Web-Services-in-Action-2nd-Edition.jpg", "book_content": "Amazon Web Services in Action, Second Edition is a comprehensive introduction to computing, storing, and networking in the AWS cloud. You’ll find clear, relevant coverage of all the essential AWS services you to know, emphasizing best practices for security, high availability and scalability. Foreword by Ben Whaley, AWS community…"}, {"book_title": "Learn R for Applied Statistics", "book_author": "Eric Goh Ming Hui", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/12/Learn-R-for-Applied-Statistics.jpg", "book_content": "Gain the R programming language fundamentals for doing the applied statistics useful for data exploration and analysis in data science and data mining. This book covers topics ranging from R syntax basics, descriptive statistics, and data visualizations to inferential statistics and regressions. After learning R’s syntax, you will…"}, {"book_title": "Scaling Your Node.js Apps", "book_author": "Fernando Doglio", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/Scaling-Your-Node.js-Apps.jpg", "book_content": "Take your Node.js application into production-ready status, capable of scaling up to whatever your needs might be. You’ll discover that architecting for successful, popular sites is an essential tool of any professional Node.js developer, and learning to scale your own applications is a great place to start. Using…"}, {"book_title": "Spring Boot 2 Recipes", "book_author": "Marten Deinum", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/Spring-Boot-2-Recipes.jpg", "book_content": "Solve all your Spring Boot 2 problems using complete and real-world code examples. When you start a new project, you’ll be able to copy the code and configuration files from this book, and then modify them for your needs. This can save you a great deal of work…"}, {"book_title": "Raspbian OS Programming with the Raspberry Pi", "book_author": "Agus Kurniawan", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/Raspbian-OS-Programming-with-the-Raspberry-Pi.jpg", "book_content": "Master the command line and Raspbian Linux as well as the physical connections of the Pi. With this book you’ll develop skills applicable to other real world applications in both hardware and software development all while working on simple and fun IoT projects that you can do yourself…."}, {"book_title": "Developing 2D Games with Unity", "book_author": "Jared Halpern", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/Developing-2D-Games-with-Unity.jpg", "book_content": "Follow a walkthrough of the Unity Engine and learn important 2D-centric lessons in scripting, working with image assets, animations, cameras, collision detection, and state management. In addition to the fundamentals, you’ll learn best practices, helpful game-architectural patterns, and how to customize Unity to suit your needs, all in…"}, {"book_title": "Emotionally Intelligent Design", "book_author": "Pamela Pavliscak", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/Emotionally-Intelligent-Design.jpg", "book_content": "As technology becomes deeply integrated into every aspect of our lives, we’ve begun to expect more emotionally intelligent interactions. But smartphones don’t know if we’re having a bad day, and cars couldn’t care less about compassion. Technology is developing more IQ, but it still lacks EQ. In this…"}, {"book_title": "Microsoft Office 2019 Inside Out", "book_author": "Joe Habraken", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/Microsoft-Office-2019-Inside-Out-400x491.jpg", "book_content": "Conquer Microsoft Office 2019–from the inside out! Dive into Microsoft Office 2019–and really put its productivity toolsand services to work! This supremely organized reference packs hundreds of timesaving solutions, tips, and workarounds–all you need to make the most of Office’s most powerful tools for productivity and decision-making. Renowned…"}, {"book_title": "Dynamics 365 CE Essentials", "book_author": "Sarah Critchley", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/Dynamics-365-CE-Essentials.jpg", "book_content": "Discover how to set up core Dynamics 365 Customer Engagement functionality and learn how to build more customized processes on top of the standard capabilities. This book starts by showing you how to set up the Dynamics 365 Online system for sales, customer service, marketing, field service, and…"}, {"book_title": "Oracle Warehouse Builder 11g R2", "book_author": "Bob Griesemer", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/Oracle-Warehouse-Builder-11g-R2-400x494.jpg", "book_content": "This easy-to-understand tutorial covers Oracle Warehouse Builder from the ground up, and taps into the author’s wide experience as a software and database engineer. Written in a relaxed style with step-by-step explanations, lots of screenshots are provided throughout the book. There are numerous tips and helpful hints throughout…"}, {"book_title": "Data Analysis and Visualization Using Python", "book_author": "Dr. Ossama Embarak", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/Data-Analysis-and-Visualization-Using-Python.jpg", "book_content": "Look at Python from a data science point of view and learn proven techniques for data visualization as used in making critical business decisions. Starting with an introduction to data science with Python, you will take a closer look at the Python environment and get acquainted with editors…"}, {"book_title": "Office 2019 For Dummies", "book_author": "Wallace Wang", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/Office-2019-For-Dummies.jpg", "book_content": "Now updated and revised to cover the latest features of Microsoft Office 2019 The world’s leading suite of business productivity software, Microsoft Office helps users complete common business tasks, including word processing, email, presentations, data management and analysis, and much more. Whether you need accessible instruction on Word,…"}, {"book_title": "Prototype and Scriptaculous in Action", "book_author": "Bear Bibeault", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/Prototype-and-Scriptaculous-in-Action-400x499.jpg", "book_content": "Prototype and Scriptaculous are libraries that extend standard Ajax. They make it easier to program Ajax and provide powerful features like drag and drop and animation. In this book, developers learn by playing and see how the libraries work in the real world. As experience with Ajax increases,…"}, {"book_title": "Beginning iOS AR Game Development", "book_author": "Allan Fowler", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/Beginning-iOS-AR-Game-Development.jpg", "book_content": "Create a fully featured application that’s both sophisticated and engaging. This book provides a detailed guide in developing augmented reality games that can take advantage of the advanced capabilities of new iOS devices and code while also offering compatibility with still supported legacy devices. No programming experience is…"}, {"book_title": "Adobe AIR in Action", "book_author": "Ashley Atkins", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/Adobe-AIR-in-Action.jpg", "book_content": "Adobe AIR is one of the hottest topics in rich application development. This exciting new technology is still in beta, but it’s already being adopted by such web giants as eBay. With AIR, Web developers use their existing skills to build rich applications that flow seamlessly between the…"}, {"book_title": "Agile Office 365", "book_author": "Haniel Croitoru", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/Agile-Office-365.jpg", "book_content": "Plan, deploy, and run Office 365 using an agile project management approach. This soup-to-nuts guide teaches you how to apply agile techniques in order to make your Office 365 implementation a success, even as the Microsoft Office 365 platform continues to evolve and introduce new features. The author’s…"}, {"book_title": "Teach Yourself VISUALLY Adobe Photoshop CS6", "book_author": "Brianna Stuart", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/Teach-Yourself-VISUALLY-Adobe-Photoshop-CS6.jpg", "book_content": "Gets visual learners up to speed on the newest enhancementsin Photoshop Photoshop is constantly evolving, and the newest version offersgreat new tools for photographers. This popular guide gets visuallearners up to speed quickly; previous editions have sold more than150,000 copies. With colorful screen shots illustrating thestep-by-step instructions, this…"}, {"book_title": "Adobe Photoshop CS6 Top 100 Simplified Tips and Tricks", "book_author": "Lynette Kent", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/Adobe-Photoshop-CS6-Top-100-Simplified-Tips-and-Tricks-400x471.jpg", "book_content": "Take your Photoshop skills to the next level Users who already know Photoshop basics will love this colorful, step-by-step guide to new tricks and techniques. Filled with beyond-the-essentials techniques that show how to take your Photoshop skills to the next level, it is lavishly illustrated with beautiful photos…"}, {"book_title": "Teach Yourself VISUALLY Office 2013", "book_author": "Elaine Marmel", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/Teach-Yourself-VISUALLY-Office-2013-400x498.jpg", "book_content": "Learn the new Microsoft Office suite the easy, visualway Microsoft Office 2013 is a power-packed suite of officeproductivity tools including Word, Excel, PowerPoint, Outlook,Access, and Publisher. This easy-to-use visual guide covers thebasics of all six programs, with step-by-step instructions andfull-color screen shots showing what you should see at…"}, {"book_title": "The Full Stack Developer", "book_author": "Chris Northwood", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/The-Full-Stack-Developer.jpg", "book_content": "Understand the technical foundations, as well as the non-programming skills needed to be a successful full stack web developer. This book reveals the reasons why a truly successful full stack developer does more than write code. You will learn the principles of the topics needed to help a…"}, {"book_title": "Pro Power BI Architecture", "book_author": "Reza Rad", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/Pro-Power-BI-Architecture.jpg", "book_content": "Architect and deploy a Power BI solution. This book will help you understand the many available options and choose the best combination for hosting, developing, sharing, and deploying a Power BI solution within your organization. Pro Power BI Architecture provides detailed examples and explains the different methods available for…"}, {"book_title": "iPhone For Dummies, 12th Edition", "book_author": "Bob LeVitus", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/iPhone-For-Dummies-12th-Edition.jpg", "book_content": "Looking for iPhone essentials? Look no further! When you carry an iPhone, you carry the power to get things done. Your pocket-sized device can keep you in touch with your friends, connect you to the world, maintain your schedule, access movies and music, and record your life in…"}, {"book_title": "Beginning Programming with C++ For Dummies, 2nd Edition", "book_author": "Stephen R. Davis", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/Beginning-Programming-with-C-For-Dummies-2nd-Edition.jpg", "book_content": "Learn to program with C++ quickly with this helpful ForDummies guide Beginning Programming with C++ For Dummies, 2ndEdition gives you plain-English explanations of the fundamentalprinciples of C++, arming you with the skills and know-how toexpertly use one of the world’s most popular programming languages.You’ll explore what goes into creating a program,…"}, {"book_title": "Block Trace Analysis and Storage System Optimization", "book_author": "Jun Xu", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/Block-Trace-Analysis-and-Storage-System-Optimization.jpg", "book_content": "Understand the fundamental factors of data storage system performance and master an essential analytical skill using block trace via applications such as MATLAB and Python tools. You will increase your productivity and learn the best techniques for doing specific tasks (such as analyzing the IO pattern in a…"}, {"book_title": "iOS 12 Programming Fundamentals with Swift", "book_author": "Matt Neuburg", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/iOS-12-Programming-Fundamentals-with-Swift.jpg", "book_content": "Move into iOS development by getting a firm grasp of its fundamentals, including the Xcode 10 IDE, Cocoa Touch, and the latest version of Apple’s acclaimed programming language, Swift 4.2. With this thoroughly updated guide, you’ll learn the Swift language, understand Apple’s Xcode development tools, and discover the…"}, {"book_title": "Microservices in .NET Core", "book_author": "Christian Horsdal", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/Microservices-in-.NET-Core.jpg", "book_content": "Microservices in .NET Core provides a complete guide to building microservice applications. After a crystal-clear introduction to the microservices architectural style, the book will teach you practical development skills in that style, using OWIN and Nancy."}, {"book_title": "Erlang and OTP in Action", "book_author": "Eric Merritt", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/Erlang-and-OTP-in-Action.jpg", "book_content": "Concurrent programming has become a required discipline for all programmers. Multi-core processors and the increasing demand for maximum performance and scalability in mission-critical applications have renewed interest in functional languages like Erlang that are designed to handle concurrent programming. Erlang, and the OTP platform, make it possible to…"}, {"book_title": "Azure in Action", "book_author": "Brian Prince", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/Azure-in-Action.jpg", "book_content": "Azure in Action is a fast-paced tutorial intended for architects and developers looking to develop cloud-based applications on the Windows Azure Platform. Written by two of Microsoft’s leading Azure evangelists, it’s designed both for readers new to cloud concepts and for those familiar with cloud development but new to…"}, {"book_title": "Hadoop in Action", "book_author": "Chuck Lam", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/Hadoop-in-Action-400x499.jpg", "book_content": "Hadoop in Action teaches readers how to use Hadoop and write MapReduce programs. The intended readers are programmers, architects, and project managers who have to process large amounts of data offline. Hadoop in Action will lead the reader from obtaining a copy of Hadoop to setting it up in a cluster…"}, {"book_title": "Microservices for the Enterprise", "book_author": "Kasun Indrasiri", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/Microservices-for-the-Enterprise.jpg", "book_content": "Understand the key challenges and solutions around building microservices in the enterprise application environment. This book provides a comprehensive understanding of microservices architectural principles and how to use microservices in real-world scenarios. Architectural challenges using microservices with service integration and API management are presented and you learn how…"}, {"book_title": "Practical React Native", "book_author": "Frank Zammetti", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/Practical-React-Native.jpg", "book_content": "Discover how to use React Native in the real world, from scratch. This book shows you what React Native has to offer, where it came from, and where it’s going. You’ll begin with a solid foundation of practical knowledge, and then build on it immediately by constructing three…"}, {"book_title": "Principles of Package Design", "book_author": "Matthias Noback", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/Principles-of-Package-Design.jpg", "book_content": "Apply design principles to your classes, preparing them for reuse. You will use package design principles to create packages that are just right in terms of cohesion and coupling, and are user- and maintainer-friendly at the same time. The first part of this book walks you through the…"}, {"book_title": "Learn Android Studio 3 with Kotlin", "book_author": "Ted Hagos", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/Learn-Android-Studio-3-with-Kotlin.jpg", "book_content": "Build Android apps using the popular and efficient Android Studio 3 suite of tools, an integrated development environment (IDE) with which Android developers can now use the Kotlin programming language. With this book, you’ll learn the latest and most productive tools in the Android tools ecosystem, ensuring quick…"}, {"book_title": "Pro .NET Memory Management", "book_author": "Konrad Kokosa", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/Pro-.NET-Memory-Management.jpg", "book_content": "Understand .NET memory management internal workings, pitfalls, and techniques in order to effectively avoid a wide range of performance and scalability problems in your software. Despite automatic memory management in .NET, there are many advantages to be found in understanding how .NET memory works and how you can…"}, {"book_title": "Practical Web Development with Haskell", "book_author": "Ecky Putrady", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/Practical-Web-Development-with-Haskell.jpg", "book_content": "Learn how to advance your skill level of Haskell, and use this language for practical web development. This book uses a direct, no nonsense approach, so you no longer need to spend extra time reading the documentation, blog posts, and forums to understand how to use Haskell –…"}, {"book_title": "hapi.js in Action", "book_author": "Matt Harrison", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/hapi.js-in-Action.jpg", "book_content": "Hapi.js in Action teaches you how to build modern Node-driven applications using hapi.js. Packed with examples, this book takes you from your first simple server through the skills you’ll need to build a complete application. Foreword by Eran Hammer."}, {"book_title": "iMac For Dummies, 10th Edition", "book_author": "Mark L. Chambers", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/iMac-For-Dummies-10th-Edition.jpg", "book_content": "The perfect companion for iMac users You’ve got a great iMac, but now it’s time to take things to the next level. This easy-to-use guide shows you how to do stuff like setting up and configuring your iMac along with fun stuff like using the Photos, Messages, and…"}, {"book_title": "Linux in Action", "book_author": "David Clinton", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/Linux-in-Action.jpg", "book_content": "Linux in Action is a task-based tutorial that will give you the skills and deep understanding you need to administer a Linux-based system. This hands-on book guides you through 12 real-world projects so you can practice as you learn. Each chapter ends with a review of best practices, new…"}, {"book_title": "Testing Angular Applications", "book_author": "Corinna Cohn", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/Testing-Angular-Applications.jpg", "book_content": "Testing is vital to the development process. It improves the quality of code and reduces maintenance, saving both time and money. But testing is sometimes neglected since there are few established resources and standards when it comes to testing modern Angular web applications. Testing Angular Applications is an example-rich,…"}, {"book_title": "Microservice Patterns", "book_author": "Chris Richardson", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/Microservices-Patterns.jpg", "book_content": "Microservices Patterns teaches enterprise developers and architects how to build applications with the microservice architecture. Rather than simply advocating for the use the microservice architecture, this clearly-written guide takes a balanced, pragmatic approach, exploring both the benefits and drawbacks."}, {"book_title": "iOS and macOS Performance Tuning", "book_author": "Marcel Weiher", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/iOS-and-macOS-Performance-Tuning.jpg", "book_content": "In iOS and macOS™ Performance Tuning, Marcel Weiher drills down to the code level to help you systematically optimize CPU, memory, I/O, graphics, and program responsiveness in any Objective-C, Cocoa, or CocoaTouch program. This guide focuses entirely on performance optimization for macOS and iOS. Drawing on more than 25 years…"}, {"book_title": "Pro SQL Server on Linux", "book_author": "Bob Ward", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/Pro-SQL-Server-on-Linux.jpg", "book_content": "Get SQL Server up and running on the Linux operating system and containers. No database professional managing or developing SQL Server on Linux will want to be without this deep and authoritative guide by one of the most respected experts on SQL Server in the industry. Get an…"}, {"book_title": "Think Complexity, 2nd Edition", "book_author": "Allen Downey", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/Think-Complexity-2nd-Edition.jpg", "book_content": "Complexity science uses computation to explore the physical and social sciences. In Think Complexity, you’ll use graphs, cellular automata, and agent-based models to study topics in physics, biology, and economics. Whether you’re an intermediate-level Python programmer or a student of computational modeling, you’ll delve into examples of complex systems…"}, {"book_title": "Deploying to OpenShift", "book_author": "Graham Dumpleton", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/Deploying-to-OpenShift.jpg", "book_content": "Get an in-depth tour of OpenShift, the container-based software deployment and management platform from Red Hat that provides a secure multi-tenant environment for the enterprise. This practical guide describes in detail how OpenShift, building on Kubernetes, enables you to automate the way you create, ship, and run applications…"}, {"book_title": "Office 365 For Dummies, 3rd Edition", "book_author": "Jennifer Reed", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/Office-365-For-Dummies-3rd-Edition.jpg", "book_content": "Everything you need to get productive in the Cloud with Office 365 With 70 million users worldwide, Microsoft Office 365 combines the familiar Office desktop suite with cloud-based versions of Microsoft’s next-generation communications and collaboration services. It offers many benefits including security, reliability, compatibility with other products, over-the-air…"}, {"book_title": "Programming iOS 12", "book_author": "Matt Neuburg", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/Programming-iOS-12.jpg", "book_content": "If you’re grounded in the basics of Swift, Xcode, and the Cocoa framework, this book provides a structured explanation of all essential real-world iOS app components. Through deep exploration and copious code examples, you’ll learn how to create views, manipulate view controllers, and add features from iOS frameworks…."}, {"book_title": "Ethereum for Architects and Developers", "book_author": "Debajani Mohanty", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/Ethereum-for-Architects-and-Developers.jpg", "book_content": "Explore the Ethereum ecosystem step by step with extensive theory, labs, and live use cases. This book takes you through BlockChain concepts; decentralized applications; Ethereum’s architecture; Solidity smart contract programming with examples; and testing, debugging, and deploying smart contracts on your local machine and on the cloud. You’ll…"}, {"book_title": "Access 2019 Bible", "book_author": "Michael Alexander", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/11/Access-2019-Bible.jpg", "book_content": "Master database creation and management Access 2019 Bible is your, comprehensive reference to the world’s most popular database management tool. With clear guidance toward everything from the basics to the advanced, this go-to reference helps you take advantage of everything Access 2019 has to offer. Whether you’re new to…"}, {"book_title": "Microsoft Dynamics 365 For Dummies", "book_author": "Renato Bellu", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/10/Microsoft-Dynamics-365-For-Dummies.jpg", "book_content": "Accelerate your digital transformation and break down silos with Microsoft Dynamics 365 It’s no secret that running a business involves several complex parts like managing staff, financials, marketing, and operations—just to name a few. That’s where Microsoft Dynamics 365, the most profitable business management tool, comes in. In Microsoft…"}, {"book_title": "Android Phones & Tablets For Dummies", "book_author": "Dan Gookin", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/10/Android-Phones-Tablets-For-Dummies.jpg", "book_content": "Outsmart your new Android Getting a smartphone or tablet can be intimidating for anyone, but this user-friendly guide is here to help you to get the most out of all your new gadget has to offer! Whether you’re upgrading from an older model or totally new to the…"}, {"book_title": "CCNA Security 640-554 Official Cert Guide", "book_author": "Keith Barker", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/10/CCNA-Security-640-554-Official-Cert-Guide.jpg", "book_content": "Trust the best selling Official Cert Guide series from Cisco Press to help you learn, prepare, and practice for exam success. They are built with the objective of providing assessment, review, and practice to help ensure you are fully prepared for your certification exam. CCNA Security 640-554 Official…"}, {"book_title": "Testing and Tuning Market Trading Systems", "book_author": "Timothy Masters", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/10/Testing-and-Tuning-Market-Trading-Systems-Algorithms-in-C.jpg", "book_content": "Build, test, and tune financial, insurance or other market trading systems using C++ algorithms and statistics. You’ve had an idea and have done some preliminary experiments, and it looks promising. Where do you go from here?  Well, this book discusses and dissects this case study approach. Seemingly good…"}, {"book_title": "Final Cut Pro X Cookbook", "book_author": "Cox Jason", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/10/Final-Cut-Pro-X-Cookbook-400x493.jpg", "book_content": "As technology becomes more and more accessible and easier to use, we are expected to do more in less time than ever before. Video editors are now expected to be able not only to edit, but create motion graphics, fix sound issues, enhance image quality and color and…"}, {"book_title": "Windows Server 2012", "book_author": "Samara Lynn", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/10/Windows-Server-2012.jpg", "book_content": "If your organization plans to move to a cloud infrastructure from a LAN or WAN, this book shows you how to do it efficiently with Windows Server 2012. Experienced Windows administrators will learn how to deploy, configure, and manage the server’s expanded capabilities and features step-by-step, using clear…"}, {"book_title": "Mastering 3D Printing in the Classroom, Library, and Lab", "book_author": "Joan Horvath", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/10/Mastering-3D-Printing-in-the-Classroom-Library-and-Lab.jpg", "book_content": "Learn how to manage and integrate the technology of 3D printers in the classroom, library, and lab. With this book, the authors give practical, lessons-learned advice about the nuts and bolts of what happens when you mix 3D printers, teachers, students, and the general public in environments ranging…"}, {"book_title": "Mastering Jenkins", "book_author": "Jonathan McAllister", "book_img": "http://www.allitebooks.com/wp-content/uploads/2018/10/Mastering-Jenkins-400x493.jpg", "book_content": "With the software industry becoming more and more competitive, organizations are now integrating delivery automation and automated quality assurance practices into their business model. Jenkins represents a complete automation orchestration system, and can help converge once segregated groups into a cohesive product development and delivery team. By mastering…"}]