[{"职位": "Python爬虫工程师", "公司": "韩国瓷肌中国区公司", "薪资": "0.8-1.3万/月", "公司福利": "员工旅游专业培训定期体检五险一金", "招聘信息": "广州-天河区|3-4年经验|大专|招2人|03-14发布", "职位信息": "天河区珠江新城华夏路30号富力盈通大厦17楼韩国瓷肌中国区公司民营公司500-1000人", "职能类别": "高级软件工程师", "公司地址": "天河区珠江新城华夏路30号富力盈通大厦17楼"}, {"职位": "爬虫工程师", "公司": "广州比地数据科技有限公司", "薪资": "0.7-1万/月", "公司福利": "五险一金餐饮补贴专业培训年终奖金", "招聘信息": "广州-天河区|2年经验|本科|招2人|03-14发布|计算机科学与技术", "职位信息": "职责：1.基于公司内部采集框架，进行模板配置，并利用Java进行爬虫程序开发；2.维护内部的爬虫模板；3.领导布置的其他工作安排。要求1.本科及以上的计算机及相关专业学历；两年以上爬虫工作经验；2.熟悉Http协议，了解常见Header、状态码，了解Ajax请求；3.熟悉Html、JavaScript、JSON数据格式，掌握正则表达式；4.Java基础+数据库基础扎实；5.踏实肯干，有责任心和团队协作精神;6.熟悉熟悉八爪鱼采集器、Jsoup、JQuery的CSS选择器者、WebMagic（Java）、Spring、Hibernate/Mybatis者、Eclipse/MyEclipse的使用或有爬虫相关工作经验；熟悉其中一到两项能力者优先考虑。广州市天河区五山路科华街251号乐天创意园B区4007广州比地数据科技有限公司民营公司50-150人", "职能类别": "数据库工程师/管理员五险一金", "公司地址": "广州市天河区五山路科华街251号乐天创意园B区4007"}, {"职位": "高级爬虫开发工程师", "公司": "广州银讯信息科技有限公司", "薪资": "1-1.5万/月", "公司福利": "周末双休节日福利餐饮补贴加班补贴带薪年假绩效奖金做五休二", "招聘信息": "广州-天河区|3-4年经验|招若干人|03-14发布", "职位信息": "岗位职责：1、分布式网络爬虫系统及数据库的设计与开发；2、设计爬虫策略和防屏蔽规则，解决封账号、封IP、验证码等难点攻克；3、编写大规模分布式网络爬虫（多线程、分布式调度、协议处理）；5、数据清洗整理类产品的应用开发、优化；构建和开发在海量数据下多维分析的数据分析平台6、精通网页抓取原理及技术、深度抓取、动态网页技术抓取、浏览器模拟抓取技术，从结构化的和非结构化的数据中获取信息；7、精通爬虫和反爬技术，精通http底层协议；精通深度抓取、动态网页技术抓取、浏览器模拟抓取技术等；8、掌握Java语言，具有开发JavaWeb的能力，对SpringBoot、SpringMVC等框架有见解。9、熟悉HtmlParser/HttpClient/Jsoup/jQuery/bootstrap中的一种或多种开源技术。1、负责图像处理和图像识别的技术研发。2、负责公司图像识别平台的产品研究，技术研究。3、负责计算机视觉应用开发、移植及优化4、负责图像处理、视频分析及目标识别算法的研发及性能优化工作5、负责相应方向技术难点攻关、前瞻研究任职要求：1.模式识别、图像处理、应用数学等相关专业本科及以上学历。2.有一定的机器视觉或图像处理方面工作经验；3.有验证码识别/机器学习／深度学习/hadoop大数据相关经验者优先。4.收集研究行业内新的技术、算法，不断提高系统对图像识别的效率与准确率5.精通图像增强、目标定位和分割、边缘提取等基本图像处理算法建工路13,15号天信楼310广州银讯信息科技有限公司民营公司50-150人", "职能类别": "软件工程师", "公司地址": "建工路13,15号天信楼310"}, {"职位": "Python爬虫工程师", "公司": "广东全彩科技有限公司", "薪资": "0.7-1.2万/月", "公司福利": "餐饮补贴绩效奖金年终奖金员工旅游定期体检交通补贴周末双休地铁周边六险一金", "招聘信息": "广州-天河区|3-4年经验|大专|招1人|03-14发布", "职位信息": "1.负责数据中心的数据采集与爬取、解析处理、入库及备份等数据日常工作；2.负责数据的清洗、整理、整合及合并等工作；4.参与需求分析及设计文档、代码的编写；5.根据工作安排，能按时按质完成需求。[职位要求]1、计算机科学与技术、软件工程等相关专业；2、熟悉linux平台，有一年以上Python编程经验，熟悉前端开发的相关领域知识；3、熟悉Scrapy,XPath、正则表达式原理等；4、具有优秀的团队合作和沟通协作能力，善于学习，乐于分享，能承受较大工作压力；5、理解Web等数据抓取的工作原理及流程，有实际数据抓取经验；6、熟练使用Mysql/MongoDB/Redis等数据库或队列。[优先条件]1.设计过除Scrapy框架以外的爬虫架构；1.对反爬虫技术有一定的理解，知道如何解决问题；2.有多线程/多进程相关的开发经验；3.有除了写代码之外的其他兴趣爱好；4.发布过开源库，或者贡献过开源代码；5.良好的英文阅读能力。珠江新城保利克洛维大厦一期17楼1710室广东全彩科技有限公司民营公司50-150人", "职能类别": "大数据开发/分析数据库工程师/管理员爬虫Python数据抓取采集清洗", "公司地址": "珠江新城保利克洛维大厦一期17楼1710室"}, {"职位": "爬虫开发工程师", "公司": "广州闪聘网络科技股份有限公司", "薪资": "1-1.5万/月", "公司福利": "带薪年假节日福利五险一金专业培训弹性工作绩效奖金", "招聘信息": "广州-天河区|1年经验|本科|招1人|03-14发布", "职位信息": "爬虫工程师工作内容：1、负责设计和开发分布式网络爬虫系统；2、解决技术疑难问题，包括反爬、压力控制，提升网页抓取的效率和质量；3、持续优化系统，提高系统的自动化、稳定性及性能岗位要求：1、计算机及相关专业，本科以上学历，1年以上爬虫开发经验；2、扎实的java基本功，了解JDK和虚拟机；熟悉常用数据结构及算法3、熟练掌握Spring等框架，深入理解框架原理和实现优先；4、熟悉Linux等操作系统，会写shell,了解常见命令；5、熟悉MYSQL数据库，了解sql优化技巧，有线上调优经验优先；广州天河区中山大道西1138号合生骏景广场1138号1625广州闪聘网络科技股份有限公司民营公司少于50人", "职能类别": "互联网软件开发工程师大数据开发/分析爬虫java爬虫工程师java爬虫", "公司地址": "广州天河区中山大道西1138号合生骏景广场1138号1625"}, {"职位": "爬虫开发工程师", "公司": "广州通易科技有限公司", "薪资": "0.8-1万/月", "公司福利": "五险一金员工旅游交通补贴餐饮补贴弹性工作年终奖金绩效奖金专业培训定期体检", "招聘信息": "广州|2年经验|本科|招1人|03-14发布|普通话", "职位信息": "1、基于业务项目数据抓取需求，定义和开发数据源；2、负责分布式网络爬虫系统的架构设计与开发（如抓取调度，多样化抓取，页面解析和结构化抽取，海量数据存储和读取等）；3、设计和优化爬虫策略，提升爬虫抓取效率与稳定性；4、系统解决动态网页内容抓取、深度网页内容抓取的关键技术；5、针对APP数据进行抓包分析，爬取APP数据并整合存储。任职要求：1、本科及以上学历，两年以上爬虫项目开发经验，熟悉如scrapy等开源爬虫框架；2、熟悉爬虫技术,包括但不限于正则表达式、脱壳技术、加密、二维码识别、滑块验证码破解、分布式爬虫调度、代理ip调度算法、配置化爬虫、授权爬虫;3、熟悉MySql、Oracle、MongoDB一种或多种数据库开发技术，有较好的数据库设计能力；4、熟悉网页抓取原理及技术、深度抓取、动态网页技术抓取、浏览器模拟抓取技术，从结构化的和非结构化的数据中获取信息；5、参与过爬虫系统的架构设计与开发，并对常见的反爬虫策略有一定的掌握；6、具有较强的分析和解决问题能力，良好的沟通能力和团队合作精神，乐于接受挑战。广州市天河区翰景路1号金星大厦14楼（五山路金山大厦旁边，华南师范大学附近）广州通易科技有限公司民营公司50-150人", "职能类别": "高级软件工程师软件工程师爬虫Python数据库数据抓取", "公司地址": "广州市天河区翰景路1号金星大厦14楼（五山路金山大厦旁边，华南师范大学附近）"}, {"职位": "Java工程师（爬虫方向）", "公司": "东莞优贸网络有限公司", "薪资": "0.8-1.3万/月", "公司福利": "五险一金员工旅游专业培训绩效奖金节日福利股票期权", "招聘信息": "东莞-南城区|3-4年经验|大专|招2人|03-14发布", "职位信息": "1、分布式网络爬虫系统的设计及开发2、互联网站、网页、链接的特征挖掘，进行网页抓取、数据提取、清洗、入库；3、负责爬虫核心算法的策略优化研究，充分利用资源，避免限制；4、优化搜索、匹配、抓取等关键程序的性能及效率。任职要求：1、2年以上java经验,有爬虫开发经验,熟练应用多线程技术.2、熟练使用正则表达式、csspath、xpath等，能够从结构化的和非结构化的数据中获取信息；3、熟练使用Mysql数据库4、熟练一种开源爬虫框架，如scrapy、webmagic、nutch、heritrix等，有开发爬虫框架经验优先；熟悉反爬虫、验证码识别技术者优先；5、具有数据挖掘、自然语言处理、信息检索、机器学习背景者优先；公司介绍：东莞优贸网络有限公司，其旗下的核心平台【优贸网】www.B2B3.com，专注于为全球贸易从业者提供精准的大数据营销服务，助力全球供应商销售业绩的增长，帮助全球进口商发现***供应商，促进全球贸易更安全更高效；优贸网拥有多种业务模式，主要收入来自于付费帐号、广告销售及多种定制数据解决方案！有意者可直接来电人事部咨询、成小姐：0769-22312980美丰路创景楼3F外交圈东莞优贸网络有限公司合资少于50人", "职能类别": "互联网软件开发工程师大数据开发/分析Java工程师爬虫开发互联网开发数据挖掘开发程序员网站工程师", "公司地址": "美丰路创景楼3F外交圈"}, {"职位": "高级爬虫工程师", "公司": "广州数说故事信息科技有限公司", "薪资": "1.5-2万/月", "公司福利": "五险一金弹性工作定期体检年终奖金员工旅游", "招聘信息": "广州-天河区|3-4年经验|本科|招1人|03-14发布", "职位信息": "岗位职责1、负责各类电商平台和app端数据抓取和平台搭建；2、负责对爬取数据进行分类和解析；3、负责开发高性能抓取架构，支持业务发展；4、负责爬虫技术公关和平台运维相关工作；任职要求1、本科及以上学历，三年及以上相关工作经验；2、熟悉linux平台，熟练掌握java/shell/http协议，熟悉HTML、DOM、XPath，掌握git、maven、svn等工具和实践，注重工程规范；3、熟悉app端数据抓取（有逆向、脱壳等经验），掌握Apktool、dex2jar、JD-GUI等工具，抓取过主流电商平台和主流app软件；4、至少1年的分布式爬虫开发经验，熟悉浏览器内核，有cef、webkit开发经验优先；5、有安卓/iOS相关开发经验者优先；6、性格开朗、善于沟通，有良好的自我驱动学习能力，注重效率和团队意识，有团队管理经验优先；广州市天河区珠江新城黄埔大道西100号富力盈泰A塔701广州数说故事信息科技有限公司民营公司150-500人", "职能类别": "高级软件工程师数据库工程师/管理员java", "公司地址": "广州市天河区珠江新城黄埔大道西100号富力盈泰A塔701"}, {"职位": "爬虫工程师", "公司": "广州中地会资讯发展有限公司", "薪资": "10-20万/年", "公司福利": "五险一金年终奖金补充医疗保险补充公积金绩效奖金", "招聘信息": "广州|3-4年经验|本科|招2人|03-14发布", "职位信息": "岗位职责：1.负责分布式网络爬虫系统的架构设计与开发；2.互联网站、网页、链接的特征挖掘，根据业务要求负责抓取互联网各种形式数据，如网页、pdf、word等数据抓取、数据提取、清洗、入库；3.负责爬虫核心算法的策略优化研究，充分利用资源，提升网页抓取的效率和质量；4.优化搜索、匹配、抓取等关键程序的性能及效率；5.取业务需求相关网页、pdf等形式数据，能够总结分析不同网站的结构特点与规律；6、负责爬虫体系和平台管理及任务安排，包括任务管理、代码管理、代码审核、爬虫运行监控及管理、问题反馈及解决等；6.进行技术分享与人员培训。任职要求：1.本科以上学历，2年以上爬虫开发相关工作经验，有大规模网络爬虫开发经验优先；2.精通Python；3.熟悉多线程、网络编程、云服务，精通网页抓取原理及技术，精通正则表达式，能从结构化的和非结构化的数据中获取信息；4.熟悉爬虫、种子、去重、提取、过滤、分发、DNScache、异步处理等概念和过程；5.具备信息检索、web挖掘等搜索引擎相关知识，有从事网络爬虫、网页去重、网页信息抓取、网页分类中至少一种程序开发经验；6.熟练使用数据库，至少精通一种关系型数据库的开发，处理过千万级别以上数据，掌握Redis、MongoDB、Hive等常用NoSQL技术并具有实战经验，熟悉hadoop者优先；7.精通至少一种开源爬虫框架，如Scrapy、Webmagic、Nutch、Heritrix等，有开发爬虫框架经验优先；8.熟悉防采集、验证码识别、图像识别、封IP等反爬技术；9.具有文本分析、数据挖掘、自然语言处理、信息检索、机器学习背景者优先；10.精通Java或C++语言优先。广州市天河区珠江新城临江大道57号中和广场8楼广州中地会资讯发展有限公司非营利组织50-150人", "职能类别": "信息技术经理/主管爬虫", "公司地址": "广州市天河区珠江新城临江大道57号中和广场8楼"}, {"职位": "服务端脚本工程师（爬虫）", "公司": "北京嗨逸酒店管理有限公司", "薪资": "1-1.5万/月", "公司福利": "出国机会弹性工作带薪年假年底双薪五险一金外派津贴发展空间大", "招聘信息": "广州-天河区|1年经验|招2人|03-14发布", "职位信息": "职位描述：广州市天河区员村四横路128号红专厂艺术创意园区C8栋2F北京嗨逸酒店管理有限公司民营公司50-150人", "职能类别": "技术支持/维护工程师计量工程师爬虫IT服务端脚本", "公司地址": "广州市天河区员村四横路128号红专厂艺术创意园区C8栋2F"}, {"职位": "SCRAPY技术顾问(爬虫)(职位编号：00410)", "公司": "广州赛意信息科技股份有限公司", "薪资": "1-1.5万/月", "公司福利": "", "招聘信息": "广州|2年经验|本科|招3人|03-14发布", "职位信息": "岗位职责：1.负责大数据项目数据集成工作的开发、测试与调优；2.负责项目中数据处理工作（数据采集、清洗、汇总、集成等）任职要求：1.本科及以上学历，计算机相关专业，熟悉数据分析系统体系架构，熟悉数据仓库建模理论、模型设计思路,并用于实际项目实践；2.熟练掌握Python、JAVA编程语言；3.熟悉linux系统环境；4.熟练掌握SQL脚本编写与调优；5.熟练掌握hiveSQL开发；6.熟悉hdfs、mapreduce、spark实现原理与机制；7.熟练掌握kafka、storm、sparkstreaming编程框架，并具备项目实施经验；(天河区)广州赛意信息科技股份有限公司上市公司1000-5000人", "职能类别": "高级软件工程师", "公司地址": "(天河区)"}]